TexasInstruments/simplelink-lowpower-f2-sdk/source/third_party/tfm/platform/ext/target/stm/stm32h573i_dk/include/flash_layout.h
/*
 * Copyright (c) 2018 Arm Limited. All rights reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#ifndef __FLASH_LAYOUT_H__
#define __FLASH_LAYOUT_H__

/* This header file is included from linker scatter file as well, where only a
 * limited C constructs are allowed. Therefore it is not possible to include
 * here the platform_retarget.h to access flash related defines. To resolve this
 * some of the values are redefined here with different names, these are marked
 * with comment.
 */

 /* Flash layout (internal flash) on stm32h573i_dk with BL2 (multiple image boot) uses ovewrite method:
 *
 * 0x0000_0000 BL2 - MCUBoot (128 KB)
 * 0x0002_0000 OTP / NV counters area (32 KB)
 * 0x0002_8000 Secure Storage Area (16 KB)
 * 0x0002_c000 Internal Trusted Storage Area (32 KB)
 * 0x0003_4000 Secure image     primary slot (184 KB)
 * 0x0006_2000 Non-secure image primary slot (640 KB)
 * 0x0010_2000 Secure image     secondary slot (184 KB)
 * 0x0013_0000 Non-secure image secondary slot (640 KB)
 * 
 ** Flash layout (internal flash) on stm32h573i_dk with BL2 (multiple image boot):
 *
 * 0x0000_0000 BL2 - MCUBoot (128 KB)
 * 0x0002_0000 SCRATCH (32 KB)
 * 0x0002_8000 OTP / NV counters area (32 KB)
 * 0x0003_2000 Secure Storage Area (16 KB)
 * 0x0003_6000 Internal Trusted Storage Area (32 KB)
 * 0x0003_e000 Secure image     primary slot (184 KB)
 * 0x0006_c000 Non-secure image primary slot (640 KB)
 * 0x0010_c000 Secure image     secondary slot (184 KB)
 * 0x0013_a000 Non-secure image secondary slot (640 KB)
 */
/* TFM Partition configuration : begin */

#define TFM_PARTITION_APP_ROT        /* comment to remove APP_ROT partition */

/*#define TFM_PARTITION_FIRMWARE_UPDATE*/  /* comment to remove TFM_PARTITION_FIRMWARE_UPDATE */

/* TFM Partition configuration : end */

/* Flash layout configuration : begin */
#define MCUBOOT_OVERWRITE_ONLY    /* Defined: the FW installation uses ovewrite method.
                                      UnDefined: The FW installation uses swap mode. */

/*#define MCUBOOT_PRIMARY_ONLY*/   /* Defined: No secondary (download) slot(s),
                                              only primary slot(s) for each image.
                                      Undefined: Primary and secondary slot(s) for each image. */

/*#define MCUBOOT_EXT_LOADER*/        /* Defined: Add external local loader application.
                                               To enter it, press user button at reset.
                                      Undefined: No external local loader application. */
#if defined (MCUBOOT_EXT_LOADER)
#define MCUBOOT_EXT_LOADER_CUSTOM    /* Defined: Use UART loader in user flash. */
#endif

#define MCUBOOT_APP_IMAGE_NUMBER 2 /* 1: S and NS application binaries are assembled in one single image.
                                      2: Two separated images for S and NS application binaries. */

#define MCUBOOT_S_DATA_IMAGE_NUMBER 0  /* 1: S data image for S application.
                                           0: No S data image. */

#define MCUBOOT_NS_DATA_IMAGE_NUMBER 0  /* 1: NS data image for NS application.
                                           0: No NS data image. */

/* Flash layout configuration : end */


/* Total number of images */
#ifndef MCUBOOT_IMAGE_NUMBER
#define MCUBOOT_IMAGE_NUMBER 2  /* (MCUBOOT_APP_IMAGE_NUMBER + MCUBOOT_S_DATA_IMAGE_NUMBER + MCUBOOT_NS_DATA_IMAGE_NUMBER)*/
#endif

/* Use image hash reference to reduce boot time (signature check bypass) */
#define MCUBOOT_USE_HASH_REF

/* control configuration */
#if (defined(MCUBOOT_PRIMARY_ONLY) || defined(MCUBOOT_OVERWRITE_ONLY)) && defined(TFM_PARTITION_FIRMWARE_UPDATE)
#error "Config not supported: TFM_PARTITION_FIRMWARE_UPDATE is activated only in swap mode"
#endif
#if defined(MCUBOOT_PRIMARY_ONLY) && !defined(MCUBOOT_OVERWRITE_ONLY)
#error "Config not supported: When MCUBOOT_PRIMARY_ONLY is enabled, MCUBOOT_OVERWRITE_ONLY is required."
#endif /* defined(MCUBOOT_PRIMARY_ONLY) */

/* The size of a partition. This should be large enough to contain a S or NS
 * sw binary. Each FLASH_AREA_IMAGE contains two partitions. See Flash layout
 * above.
 */
#define LOADER_FLASH_DEV_NAME             TFM_Driver_FLASH0

/* Flash layout info for BL2 bootloader */
#define FLASH_AREA_IMAGE_SECTOR_SIZE    (0x2000)     /* 8 KB */
#define FLASH_AREA_WRP_GROUP_SIZE       (0x8000)     /* 32 KB */
#define FLASH_B_SIZE                    (0x100000)   /* 1 MBytes*/
#define FLASH_TOTAL_SIZE                (FLASH_B_SIZE+FLASH_B_SIZE) /* 2 MBytes */
#define FLASH_BASE_ADDRESS              (0x0c000000) /* same as FLASH0_BASE_S */

/* Flash area IDs */
#define FLASH_AREA_0_ID                 (1)
#if (MCUBOOT_APP_IMAGE_NUMBER == 2)
#define FLASH_AREA_1_ID                 (2)
#endif /* MCUBOOT_APP_IMAGE_NUMBER == 2 */
#if !defined(MCUBOOT_PRIMARY_ONLY)
#define FLASH_AREA_2_ID                 (3)
#if (MCUBOOT_APP_IMAGE_NUMBER == 2)
#define FLASH_AREA_3_ID                 (4)
#endif /* MCUBOOT_APP_IMAGE_NUMBER == 2 */
#endif /* MCUBOOT_PRIMARY_ONLY */
#if (MCUBOOT_S_DATA_IMAGE_NUMBER == 1)
#define FLASH_AREA_4_ID                 (5)
#endif /* MCUBOOT_S_DATA_IMAGE_NUMBER == 1 */
#if (MCUBOOT_NS_DATA_IMAGE_NUMBER == 1)
#define FLASH_AREA_5_ID                 (6)
#endif /* MCUBOOT_NS_DATA_IMAGE_NUMBER == 1 */
#if !defined(MCUBOOT_PRIMARY_ONLY)
#if (MCUBOOT_S_DATA_IMAGE_NUMBER == 1)
#define FLASH_AREA_6_ID                 (7)
#endif /* MCUBOOT_S_DATA_IMAGE_NUMBER == 1 */
#if (MCUBOOT_NS_DATA_IMAGE_NUMBER == 1)
#define FLASH_AREA_7_ID                 (8)
#endif /* MCUBOOT_NS_DATA_IMAGE_NUMBER == 1 */
#define FLASH_AREA_SCRATCH_ID           (9)
#endif /* MCUBOOT_PRIMARY_ONLY */

/* Offset and size definitions of the flash partitions that are handled by the
 * bootloader. The image swapping is done between IMAGE_0 and IMAGE_1, SCRATCH
 * is used as a temporary storage during image swapping.
 */

/* Area for downloading bl2 image */
#define FLASH_AREA_BL2_BIN_OFFSET       (0x0)
/* area for BL2 code protected by hdp */
#define FLASH_AREA_BL2_OFFSET           (0x0)
#if defined(EXTERNAL_FLASH)
#define FLASH_AREA_BL2_SIZE             (0xF800)
#else
#define FLASH_AREA_BL2_SIZE             (0x20000)
#endif /* EXTERNAL_FLASH */
/* HDP area end at this address */
#define FLASH_BL2_HDP_END               (FLASH_AREA_BL2_OFFSET+FLASH_AREA_BL2_SIZE-1)

/* area for BL2 code not protected by hdp */
#define FLASH_AREA_BL2_NOHDP_OFFSET     (FLASH_AREA_BL2_OFFSET+FLASH_AREA_BL2_SIZE)
#if defined(EXTERNAL_FLASH)
#define FLASH_AREA_BL2_NOHDP_SIZE       (0x1800)
#else
#define FLASH_AREA_BL2_NOHDP_SIZE       (FLASH_AREA_IMAGE_SECTOR_SIZE)
#endif /* EXTERNAL_FLASH */


/* scratch area */
#if defined(FLASH_AREA_SCRATCH_ID)
#define FLASH_AREA_SCRATCH_DEVICE_ID    (FLASH_DEVICE_ID - FLASH_DEVICE_ID)
#define FLASH_AREA_SCRATCH_OFFSET       (FLASH_AREA_BL2_NOHDP_OFFSET + FLASH_AREA_BL2_NOHDP_SIZE)
#if defined(MCUBOOT_OVERWRITE_ONLY)
#define FLASH_AREA_SCRATCH_SIZE         (0x0000) /* Not used in MCUBOOT_OVERWRITE_ONLY mode */
#else
#define FLASH_AREA_SCRATCH_SIZE         (0x8000) /* 32 KB */
#endif
#endif

/* area for bl2 anti roll back counter */
#define FLASH_BL2_NVCNT_AREA_OFFSET     (FLASH_AREA_SCRATCH_OFFSET + FLASH_AREA_SCRATCH_SIZE)
#define FLASH_BL2_NVCNT_AREA_SIZE       (FLASH_AREA_IMAGE_SECTOR_SIZE+FLASH_AREA_IMAGE_SECTOR_SIZE)

/* Non Volatile Counters definitions */
#define FLASH_NV_COUNTERS_AREA_OFFSET   (FLASH_BL2_NVCNT_AREA_OFFSET+FLASH_BL2_NVCNT_AREA_SIZE)
#define FLASH_NV_COUNTERS_AREA_SIZE      (FLASH_AREA_IMAGE_SECTOR_SIZE+FLASH_AREA_IMAGE_SECTOR_SIZE)

/* OTP / Non Volatile Counters definitions */
#define FLASH_OTP_NV_COUNTERS_SECTOR_SIZE   (FLASH_AREA_IMAGE_SECTOR_SIZE)
#if defined(EXTERNAL_FLASH)
#define FLASH_OTP_NV_COUNTERS_AREA_OFFSET   (FLASH_NV_COUNTERS_AREA_OFFSET + \
                                             FLASH_NV_COUNTERS_AREA_SIZE)
#else
/* fix me with overwrite scratch is not required */
#define FLASH_OTP_NV_COUNTERS_AREA_OFFSET   (FLASH_NV_COUNTERS_AREA_OFFSET + \
                                             FLASH_NV_COUNTERS_AREA_SIZE)
#endif /* defined(EXTERNAL_FLASH) */

